In [1]:
# python to Mysql connect

In [2]:
import pymysql as py
print('Done')

Done

In [1]:
# pip install PyMySQL

In [3]:
conn = py.connect(user = 'root',
           password = 'divyansh_0047',
           host = 'localhost',
           autocommit = True)
print('Connection Created Successfully')
print('Done')

Connection Created Successfully
Done

In [6]:
# create databse using python

In [4]:
cur = conn.cursor()
print('Done')

Done

In [10]:
# create databse using python

In [14]:
query = '''create database IITMD;'''

cur.execute(query)
print('Done')

Done

In [5]:
query = '''USE IITMD;'''
cur.execute(query)
print('Done')

Done

In [29]:
query = '''insert into student_details
values
(101,"Mohan Sharma","BCA","Delhi Janakpuri",5000),
(105,"Ravi verma","MCA","South Delhi",5500);
'''
cur.execute(query)
print('Done')

Done

In [11]:

sid = int(input('Enter Roll No/SID: '))
name = input('Enter your Name:')
course = input('enter your Course')
address =  input('Enter your Address')
scholarship = float(input('Enter your scholarship in RS'))

q = f'''insert into student_details values 
({sid},"{name}","{course}","{address}",{scholarship});'''
cur.execute(q)
print('Done')

Enter Roll No/SID:  104
Enter your Name: Shreya
enter your Course BCOM
Enter your Address New Delhi
Enter your scholarship in RS 8000

Done

In [24]:
query = '''select * from student_details;'''

cur.execute(query)

records = cur.fetchall()


import pandas as pd  
pd.DataFrame(records)

     0             1     2                3     4
0  101  Mohan Sharma   BCA  Delhi Janakpuri  5000
1  105    Ravi verma   MCA      South Delhi  5500
2    1             1     1                1     1
3    1             1     1                1     1
4  111        aayush   bca           dwarka  6000
5  102  Harshwardhan   BBA        Rani Bagh  6600
6  103        chintu   BCA       Lado Sarai  5000
7  104        Shreya  BCOM        New Delhi  8000

In [34]:
all_columns = []
for i in cur.description:
    current_column=i[0]
    all_columns.append(current_column)
print(all_columns)

['SID', 'student_name', 'course', 'Address', 'scholarship']

In [38]:
query7 = '''
 select * from student_details;
 
 
 '''
cur.execute(query7)
records = cur.fetchall()

import pandas as pd
pd.DataFrame(records,columns=all_columns)

   SID  student_name course          Address  scholarship
0  101  Mohan Sharma    BCA  Delhi Janakpuri         5000
1  105    Ravi verma    MCA      South Delhi         5500
2    1             1      1                1            1
3    1             1      1                1            1
4  111        aayush    bca           dwarka         6000
5  102  Harshwardhan    BBA        Rani Bagh         6600
6  103        chintu    BCA       Lado Sarai         5000
7  104        Shreya   BCOM        New Delhi         8000

In [50]:

def show_records(db,table):
    query8 = f'''select * from {db}.{table};'''
    cur.execute(query8)

    
    records = cur.fetchall()
    
    all_columns = []
    for i in cur.description:
        all_columns.append(i[0])
        
    import pandas as pd
    df=pd.DataFrame(records,columns=all_columns)
    return df

In [51]:
conn.close()
print('Done')

Done